%% clear everything
clc;
close all;
clear all;




Ts = [0,15] ;
r = @(t)(0);  % 1ο Σενάριο
%r = @(t)(0.00437*(3.5*sin(0.5*t)+3*cos(0.5*t)));  %2ο Σενάριο (α)
%r = @(t)(11.8125*cos(90*t) - 354.288*sin(90*t));  %2o Σενάριο (β)
lam = 2.9;
xo = [0; 0 ; 0 ; 0 ; 0; 0] ;
[T,X] = ode45(@(t,x)symperifora_2(t,x,r),Ts,xo);
e = X(:,1) - X(:,5) ;  % σφάλμα εξόδου 
E = X(:,2) - X(:,6) ;  % σφάλμα ταχύτητας
U = (2-lam)*X(:,3)  + (-lam^2/2+12*lam-20)*X(:,4)  + (7+lam/2)*X(:,1) + r(T)  ; % ελεγκτής

%ed = X(:,1) - 0.0175*sin(0.5*T) ;  %σφάλμα παρακολούθησης επιθυμητού σήματος (σύστημα) (α)
%ed = X(:,1) - 0.0873*sin(90*T) ;   %σφάλμα παρακολούθησης επιθυμητού σήματος (σύστημα) (β)
plot(T,X(:,1), 'r' , T, X(:,5), 'b' , T,e , 'y' );
%plot(T,X(:,2), 'r' , T, X(:,6), 'b' , T,E, 'y' );
%plot(T,U);
%plot(T,ed , 'y' , T,X(:,1) , 'r' , T,0.0175*sin(0.5*T) , 'b' ) ; %(α)
%plot(T,ed , 'y' , T,X(:,1) , 'r' , T,0.0873*sin(90*T) , 'b' ) ;  %(β)
%plot(T,X(:,5) - 0.0175*sin(0.5*T));


