function dx = symperifora_2(t,x,r)
% F= -λ  (lam) , g  = 1 , M-G-C δίνονται, x(5)-x(6) καταστάσεις του μοντέλου
% αναφοράς, x(3)-x(4) = ω1-ω2 , θ* = [2-lam;-lam^2/2 + 12*lam-20 ; 7+lam/2  ; 1] , lam = φίλτρο (Λ(s) = s + lam) ,  x(1) - x(2) οι
% καταστάσεις του ελεγχόμενου συστήματος. 
    
    %επιλογές
    
    lam = 200; % lam > 0
    
    
    % εξισώσεις κατάστασης
    
    u = [2-lam;-lam^2/2 + 12*lam-20 ; 7+lam/2  ; 1]'*[x(3) ; x(4) ; x(1) ; r(t)];
    dx(1) = x(2);
    dx(2) = -20*sin(x(1)) - 2*x(2) + 2*u ;
    dx(3) = -lam*x(3) + u ;
    dx(4) = -lam*x(4) + x(1) ;
    dx(5) = x(6) ;
    dx(6) = -2*x(5) - 3*x(6) + 2*r(t) ;  
    
    dx = dx' ;
    
end

    
    
    